sterentev/atdf-device-asm-include/inc/ATmega644P.inc
; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  COMM_SCK_RATE_3BIT	:::: values
;			0b000		; fosc/4
;			0b001		; fosc/16
;			0b010		; fosc/64
;			0b011		; fosc/128
;			0b100		; fosc/2
;			0b101		; fosc/8
;			0b110		; fosc/32
;			0b111		; fosc/64



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 31
.equ	INT_VECTORS_SIZE	= 0x3E
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin,Power-on Reset,Brown-out Reset,Watchdog Reset,and JTAG AVR Reset. See Datasheet.     
;	1	INT0		; External Interrupt Request 0
;	2	INT1		; External Interrupt Request 1
;	3	INT2		; External Interrupt Request 2
;	4	PCINT0		; Pin Change Interrupt Request 0
;	5	PCINT1		; Pin Change Interrupt Request 1
;	6	PCINT2		; Pin Change Interrupt Request 2
;	7	PCINT3		; Pin Change Interrupt Request 3
;	8	WDT		; Watchdog Time-out Interrupt
;	9	TIMER2_COMPA	; Timer/Counter2 Compare Match A
;	10	TIMER2_COMPB	; Timer/Counter2 Compare Match B
;	11	TIMER2_OVF	; Timer/Counter2 Overflow
;	12	TIMER1_CAPT	; Timer/Counter1 Capture Event
;	13	TIMER1_COMPA	; Timer/Counter1 Compare Match A
;	14	TIMER1_COMPB	; Timer/Counter1 Compare Match B
;	15	TIMER1_OVF	; Timer/Counter1 Overflow
;	16	TIMER0_COMPA	; Timer/Counter0 Compare Match A
;	17	TIMER0_COMPB	; Timer/Counter0 Compare Match B
;	18	TIMER0_OVF	; Timer/Counter0 Overflow
;	19	SPI_STC		; SPI Serial Transfer Complete
;	20	USART0_RX	; USART0, Rx Complete
;	21	USART0_UDRE	; USART0 Data register Empty
;	22	USART0_TX	; USART0, Tx Complete
;	23	ANALOG_COMP	; Analog Comparator
;	24	ADC		; ADC Conversion Complete
;	25	EE_READY	; EEPROM Ready
;	26	TWI		; 2-wire Serial Interface
;	27	SPM_READY	; Store Program Memory Read
;	28	USART1_RX	; USART1 RX complete
;	29	USART1_UDRE	; USART1 Data Register Empty
;	30	USART1_TX	; USART1 TX complete


; ====	ASM PROGRAM SKELETON				========
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET		; RESET		 - External Pin,Power-on Reset,Brown-out Reset,Watchdog Reset,and JTAG AVR Reset. See Datasheet.     
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt Request 0
;#		reti			; INT1		 - External Interrupt Request 1
;#		reti			; INT2		 - External Interrupt Request 2
;#		rjmp	PCINT0_ISR	; PCINT0	 - Pin Change Interrupt Request 0
;#		reti			; PCINT1	 - Pin Change Interrupt Request 1
;#		reti			; PCINT2	 - Pin Change Interrupt Request 2
;#		reti			; PCINT3	 - Pin Change Interrupt Request 3
;#		reti			; WDT		 - Watchdog Time-out Interrupt
;#		reti			; TIMER2_COMPA	 - Timer/Counter2 Compare Match A
;#		reti			; TIMER2_COMPB	 - Timer/Counter2 Compare Match B
;#		reti			; TIMER2_OVF	 - Timer/Counter2 Overflow
;#		reti			; TIMER1_CAPT	 - Timer/Counter1 Capture Event
;#		reti			; TIMER1_COMPA	 - Timer/Counter1 Compare Match A
;#		reti			; TIMER1_COMPB	 - Timer/Counter1 Compare Match B
;#		reti			; TIMER1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIMER0_COMPA	 - Timer/Counter0 Compare Match A
;#		reti			; TIMER0_COMPB	 - Timer/Counter0 Compare Match B
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		reti			; SPI_STC	 - SPI Serial Transfer Complete
;#		reti			; USART0_RX	 - USART0, Rx Complete
;#		reti			; USART0_UDRE	 - USART0 Data register Empty
;#		reti			; USART0_TX	 - USART0, Tx Complete
;#		reti			; ANALOG_COMP	 - Analog Comparator
;#		reti			; ADC		 - ADC Conversion Complete
;#		rjmp	EE_READY_ISR	; EE_READY	 - EEPROM Ready
;#		reti			; TWI		 - 2-wire Serial Interface
;#		reti			; SPM_READY	 - Store Program Memory Read
;#		reti			; USART1_RX	 - USART1 RX complete
;#		reti			; USART1_UDRE	 - USART1 Data Register Empty
;#		reti			; USART1_TX	 - USART1 TX complete
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET:
;#		cli
;#		ldi	r16, high(ADDR_IRAM_END)
;#		out	SP+1, r16
;#		ldi	r16, low(ADDR_IRAM_END)
;#		out	SP, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATMEGA644P_INC_ */

; ************************ END OF FILE *********************************

